In [1]:
import numpy as np 
import pandas as pd

In [12]:
data = np.random.randint(100, size=(4,3))

In [13]:
data

array([[40, 11,  0],
       [89, 90, 75],
       [63, 68, 69],
       [78, 36, 40]], dtype=int32)

In [16]:
df = pd.DataFrame(data)

In [17]:
df

    0   1   2
0  40  11   0
1  89  90  75
2  63  68  69
3  78  36  40

In [18]:
df[0] # sifirinci stunu getir

0    40
1    89
2    63
3    78
Name: 0, dtype: int32

In [19]:
new_df = pd.DataFrame(data, index=["Ahmet", "Omer", "Ayse", "Mustafa"], columns= ["Salary","Age","Seniority"])

In [20]:
new_df

         Salary  Age  Seniority
Ahmet        40   11          0
Omer         89   90         75
Ayse         63   68         69
Mustafa      78   36         40

In [22]:
new_df["Age"]

Ahmet      11
Omer       90
Ayse       68
Mustafa    36
Name: Age, dtype: int32

In [25]:
new_df[["Salary","Age"]] # birden cok stunu gösterirken liste icinde liste seklinde yapman gerekli

         Salary  Age
Ahmet        40   11
Omer         89   90
Ayse         63   68
Mustafa      78   36

In [31]:
# new_df["Ahmet"] # burada hata vermesinin sebebi column degilde row arattigin icin atil diye bir column yok diyor.

In [35]:
new_df.loc["Ahmet"] # bu sekil rowu cagirabilirsin.

Salary       40
Age          11
Seniority     0
Name: Ahmet, dtype: int32

In [36]:
new_df.iloc[0] # burada da index e göre cagirabilirsin.

Salary       40
Age          11
Seniority     0
Name: Ahmet, dtype: int32

In [37]:
new_df.iloc[1]

Salary       89
Age          90
Seniority    75
Name: Omer, dtype: int32

In [40]:
new_df.iloc[:,0] # burada iloc kullanarak tum rowlari secip istedigimiz stunu gösteriyor. 0. stunu gösteriyor.

Ahmet      40
Omer       89
Ayse       63
Mustafa    78
Name: Salary, dtype: int32

In [43]:
new_df["Extra"] = 10 # burada yeni bir Extra isimli column ekledi ve tum degerlere 10 atadi.

In [44]:
new_df

         Salary  Age  Seniority  Extra
Ahmet        40   11          0     10
Omer         89   90         75     10
Ayse         63   68         69     10
Mustafa      78   36         40     10

In [46]:
new_df.drop("Extra", axis=1) # burada da Extra columnu siliyor. axis=1 olmasi da columnu ifade ediyor. 
# yani eger columnda ve row da da ayni isimli column ve row varsa karismasin diye axis belirtiyoruz.
# axis=0 rowlari ifade ediyor , axis=1 columnlari ifade ediyor.

         Salary  Age  Seniority
Ahmet        40   11          0
Omer         89   90         75
Ayse         63   68         69
Mustafa      78   36         40

In [48]:
new_df # yukarida Extra columnunu silmistik ama burada hala gözukuyor. drop ifadesi columnu siliyor ama ana dataframeden silmiyor,
# bunu duzeltmek icin asagidakileri yapabilirsin

         Salary  Age  Seniority  Extra
Ahmet        40   11          0     10
Omer         89   90         75     10
Ayse         63   68         69     10
Mustafa      78   36         40     10

In [53]:
new_df = new_df.drop("Extra", axis=1)
#new_df.drop("Extra" , axis=1 , inplace=True) #inplace=True demek bu silme islemini ana dataframede yap demek 
# tekrar ayri bir df dondurme diyor yani.

In [51]:
new_df

         Salary  Age  Seniority
Ahmet        40   11          0
Omer         89   90         75
Ayse         63   68         69
Mustafa      78   36         40

In [54]:
new_df > 50

         Salary    Age  Seniority
Ahmet     False  False      False
Omer       True   True       True
Ayse       True   True       True
Mustafa    True  False      False

In [60]:
new_df[new_df > 50] # df deki 50 den buyuk degerleri goster

         Salary   Age  Seniority
Ahmet       NaN   NaN        NaN
Omer       89.0  90.0       75.0
Ayse       63.0  68.0       69.0
Mustafa    78.0   NaN        NaN

In [61]:
new_df[new_df["Age"] >50 ] # Age columnunun 50 den buyuk degerlerini göster

      Salary  Age  Seniority
Omer      89   90         75
Ayse      63   68         69

In [64]:
new_df.reset_index() # indexi sayi seklinde yaptik.
# new_df.set_index("NewIndex") seklinde kendi istedigimiz indexleri index yapabiliriz

     index  Salary  Age  Seniority
0    Ahmet      40   11          0
1     Omer      89   90         75
2     Ayse      63   68         69
3  Mustafa      78   36         40

In [67]:
# Multi index
first_index = ["Ogrenci","Ogrenci","Ogrenci","Ogretmen","Ogretmen","Ogretmen"]
inner_index = ["Omer","Ayse","Mustafa","Atil","Samancioglu","Mehmet"]

In [68]:
zipped_index = list(zip(first_index, inner_index))

In [69]:
zipped_index

[('Ogrenci', 'Omer'),
 ('Ogrenci', 'Ayse'),
 ('Ogrenci', 'Mustafa'),
 ('Ogretmen', 'Atil'),
 ('Ogretmen', 'Samancioglu'),
 ('Ogretmen', 'Mehmet')]

In [71]:
zipped_index = pd.MultiIndex.from_tuples(zipped_index)

In [72]:
zipped_index

MultiIndex([( 'Ogrenci',        'Omer'),
            ( 'Ogrenci',        'Ayse'),
            ( 'Ogrenci',     'Mustafa'),
            ('Ogretmen',        'Atil'),
            ('Ogretmen', 'Samancioglu'),
            ('Ogretmen',      'Mehmet')],
           )

In [73]:
sample_values = np.ones((6,2))

In [75]:
big_df = pd.DataFrame(sample_values, index=zipped_index , columns= ["Age","Note"])

In [77]:
big_df # burada iki indexe sahip bir dataframe olusturduk yukaridaki islemler ed bunun adimlariydi.

                      Age  Note
Ogrenci  Omer         1.0   1.0
         Ayse         1.0   1.0
         Mustafa      1.0   1.0
Ogretmen Atil         1.0   1.0
         Samancioglu  1.0   1.0
         Mehmet       1.0   1.0

In [79]:
big_df.loc["Ogrenci"].loc["Omer"] # bu sekilde de icerideki indexten eleman cagirabiliriz.

Age     1.0
Note    1.0
Name: Omer, dtype: float64